cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'homebrew/cask-fonts'

brew 'git'
brew 'git-subrepo'
brew 'ack'                              # grep for programmers
brew 'coreutils'
#brew 'go'
brew 'grc'                              # Colors for logfiles
brew 'imagemagick'
brew 'jp2a'
brew 'jq'                               # JSON
#brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'                          # git lib in C to use in application with C bindings
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'               # webserver for Ruby/Rack apps
brew 'ruby-build'                       # for rbenv
brew 'rbenv'
#brew 'roundup'                          # unit testing for shell scripts
brew 'spaceman-diff'                    # git diff for images
brew 'spark'                            # graphs in the terminal
brew 'unrar'  
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'syncthing', start_service: true

# Fonts
# Monospaced fonts with ligatures: Fira Code, Monoid, and Hasklig
cask 'font-fira-code'

cask '1password'
cask 'adium'
#cask 'atom'
cask 'firefox'
#cask 'garmin-express'                   # Manage GPS devices
#cask 'google-chrome'
cask 'handbrake'
#cask 'mapbox-studio'                    # Design custom maps that fit seamlessly in your application.
#cask 'seashore'                         # image editor
cask 'slack'
cask 'mattermost'
cask 'steam'
cask 'transmission'
#cask 'tunnelbear'                         # VPN
cask 'vlc'

# My added apps
cask 'dash'
cask 'sequel-pro'
cask 'alfred'
cask 'spectacle'
#cask 'dropbox'
cask 'sketch'
cask 'imageoptim'
#cask 'CocoaPacketAnalyzer' # not available
cask 'chromium'
cask 'brave-browser'
cask 'forklift'
cask 'bino'
cask 'evernote'
#cask 'goSerial'  # not available
cask 'GrandPerspective'
cask 'Hex-Fiend'
#cask 'hopper-disassembler' # not available
#cask 'istat-menus' # not available
cask 'little-snitch'
cask 'MAMP'
cask 'MoneyMoney'
cask 'MacDown'
cask 'MPlayerX'
#cask 'Pleasant3D'  # not available
#cask 'plex-media-server'                  # Want this really?
#cask 'plex-home-theater'                  # 'plex-media-player' 
cask 'prefs-editor'
cask 'syncthing'
cask 'Slic3r'
cask 'sparkleshare'
cask 'sublime-text'
#cask 'teleport'   # not available
cask 'GPG-Suite'
cask 'tunnelblick'

# Quicklook
cask 'qlcolorcode' 
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'BetterZip'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'qlvideo'

