cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'                              # grep for programmers
brew 'coreutils'
#brew 'go'
brew 'grc'                              # Colors for logfiles
brew 'imagemagick'
brew 'jp2a'
brew 'jq'                               # JSON
#brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'                          # git lib in C to use in application with C bindings
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'               # webserver for Ruby/Rack apps
brew 'ruby-build'                       # for rbenv
brew 'rbenv'
#brew 'roundup'                          # unit testing for shell scripts
brew 'spaceman-diff'                    # git diff for images
brew 'spark'                            # graphs in the terminal
brew 'unrar'  
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
#cask 'adium'
#cask 'atom'
cask 'firefox'
#cask 'garmin-express'                   # Manage GPS devices
#cask 'google-chrome'
cask 'handbrake'
#cask 'mapbox-studio'                    # Design custom maps that fit seamlessly in your application.
#cask 'seashore'                         # image editor
cask 'slack'
cask 'steam'
cask 'transmission'
#cask 'tunnelbear'                         # VPN
cask 'vlc'

# My added apps
cask 'dash'
cask 'sequel pro'
cask 'alfred'
cask 'spectacle'
cask 'dropbox'
cask 'sketch'
cask 'imageoptim'
cask 'CocoaPacketAnalyzer'
cask 'chromium'
cask 'forklift'
cask 'reeder'
cask 'forklift'
cask 'bino'
cask 'evernote'
cask 'GrandPerspective'
cask 'Hex-Fiend'
cask 'hopper-disassembler'
cask 'istat-menus'
cask 'little-snitch'
cask 'MAMP'
cask 'MoneyMoney'
cask 'Mou'
cask 'MPlayerX'
cask 'Pleasant3D'
cask 'plex-media-server'                  # Want this really?
cask 'plex-media-player'
cask 'prefs-editor'
cask 'resilio-sync'
cask 'Slic3r'
cask 'sparkleshare'
cask 'sublime'
cask 'teleport'

# Quicklook
cask 'qlcolorcode' 
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

